12/data/attachments/84c27dc138c28d0c.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_d687860b-2364-4b89-af16-4ccb3a34a4c6</nif:username>
            <nif:friendToBeAdded>John_at_Friend_19728_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>